# PrimarySizeCriterion Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrimarySizeCriterion Class
Members See Also
---
This class contains a size criterion for a RoutingPreferenceRule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class PrimarySizeCriterion : RoutingCriterionBase
```

Visual Basic
---
```text
Public Class PrimarySizeCriterion _
	Inherits RoutingCriterionBase
```

Visual C++
---
```text
public ref class PrimarySizeCriterion : public RoutingCriterionBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RoutingCriterionBase Autodesk.Revit.DB..::..PrimarySizeCriterion
# See Also
PrimarySizeCriterion Members
Autodesk.Revit.DB Namespace